a5021/stm32-async-1wire/src/ds18b20.c
#include "ds18b20.h"
#include "macro.h"
#include "onewire.h"
#include "stm32f1xx.h"

/**
 * @defgroup DS18B20_Private_Types DS18B20 Private Types
 * @{
 */

/**
 * @defgroup DS18B20_Private_Constants DS18B20 Private Constants
 * @{
 */

/** @brief Duration of '1' bit pulse in microseconds (from the 1-Wire layer) */
#define ONE_PULSE ONEWIRE_ONE_PULSE
/** @brief Duration of '0' bit pulse in microseconds (from the 1-Wire layer) */
#define ZERO_PULSE ONEWIRE_ZERO_PULSE
/** @brief Guard band between slots to prevent overlap due to bus rise time and DMA latency */
#define GUARD_BAND ONEWIRE_GUARD_BAND
/** @brief Total length of DS18B20 scratchpad in bytes */
#define DS18B20_SCRATCHPAD_LEN 9
/** @brief Number of bytes to include in the scratchpad CRC calculation */
#define DS18B20_CRC8_BYTES 8
/** @brief Total number of bits in DS18B20 scratchpad */
#define DS18B20_SCRATCHPAD_BITS (DS18B20_SCRATCHPAD_LEN * DS18B20_BITS_PER_BYTE)
/** @brief Pulse threshold separating short ('1') from long ('0') slots (from the 1-Wire layer) */
#define SHORT_PULSE_MAX ONEWIRE_SHORT_PULSE_MAX
/** @brief Total slots for Match ROM + 8-byte ROM + command */
#define DS18B20_MATCH_SLOTS ((DS18B20_ROM_BYTES + 2) * DS18B20_BITS_PER_BYTE)
/** @brief Slots for the invariant Match ROM + 8-byte ROM prefix (built on select) */
#define DS18B20_PREFIX_SLOTS ((DS18B20_ROM_BYTES + 1) * DS18B20_BITS_PER_BYTE)
/** @brief Number of DMA transfers for command transmission (2 bytes × 8 bits) */
#define DS18B20_DMA_TRANSFERS (2 * DS18B20_BITS_PER_BYTE)
/** @brief Timer configuration for wait and pause (ARR, RCR) — 62500 ticks @ 1µs = 62.5ms per period */
#define PAUSE_750MS 62500, 11 /**< 750ms delay for temperature conversion (62.5ms × 12) */
#define PAUSE_5S 62500, 79 /**< 5s pause between measurement cycles (62.5ms × 80) */
#define SCAN_DEVICE_GAP 1000, 0 /**< 1ms scheduling bridge between scan-mode device reads (no bus requirement) */
/** @brief TH byte written together with the config register by the resolution
 *         state machine (Write Scratchpad requires TH + TL + CFG in one go).
 *         0 disables the alarm trigger threshold. */
#define DS18B20_RES_TH 0x00
/** @brief TL byte written together with the config register by the resolution
 *         state machine. 0 disables the alarm trigger threshold. */
#define DS18B20_RES_TL 0x00
/** @brief Bytes in the resolution config write for Skip ROM mode
 *         (Skip ROM 0xCC + Write Scratchpad 0x4E + TH + TL + CFG) */
#define DS18B20_RES_BYTES_MIN (1 + 1 + 3)
/** @brief Bytes in the resolution config write for Match ROM mode
 *         (Match ROM 0x55 + 8-byte ROM + 0x4E + TH + TL + CFG) */
#define DS18B20_RES_BYTES_MAX (1 + DS18B20_ROM_BYTES + 1 + 3)
/** @brief Slots for the Skip ROM resolution config write */
#define DS18B20_RES_SLOTS_MIN (DS18B20_RES_BYTES_MIN * DS18B20_BITS_PER_BYTE)
/** @brief Slots for the Match ROM resolution config write */
#define DS18B20_RES_SLOTS_MAX (DS18B20_RES_BYTES_MAX * DS18B20_BITS_PER_BYTE)
/** @brief Wait for Copy Scratchpad (t_COPY) / Recall EEPROM (t_RECALL)
 *         completion in microseconds (DS18B20 datasheet: 10ms max). */
#define DS18B20_EEPROM_WAIT_US 10000

/**
 * @brief Convert byte bit to pulse duration (ONE_PULSE µs for '1', ZERO_PULSE µs for '0')
 * @param B Byte value
 * @param N Bit position (0-7)
 * @return Pulse duration in microseconds
 */
#define B2P(B, N) (((B) & (1 << (N))) ? ONE_PULSE : ZERO_PULSE)

/**
 * @brief Convert entire byte to sequence of pulse durations for transmission
 * @param B Byte value to convert
 */
#define BYTE_TO_PULSES(B)                       \
    B2P(B, 0), B2P(B, 1), B2P(B, 2), B2P(B, 3), \
        B2P(B, 4), B2P(B, 5), B2P(B, 6), B2P(B, 7)

/** @brief DS18B20 Convert T command sequence in pulse duration format */
static const uint8_t conv_cmd[] = {BYTE_TO_PULSES(0xCC), BYTE_TO_PULSES(0x44), 0};

/** @brief DS18B20 Read Scratchpad command sequence in pulse duration format */
static const uint8_t read_cmd[] = {BYTE_TO_PULSES(0xCC), BYTE_TO_PULSES(0xBE), 0};

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Types DS18B20 Private Types
 * @{
 */

/**
 * @brief DS18B20 driver context structure using union for memory efficiency
 * @note Different stages of communication use the same memory for different purposes
 */
typedef struct {
    /**
     * @brief Union overlay for memory efficiency
     * @warning CRITICAL INVARIANT: scratchpad[n] aliases pulse[n] (same byte).
     *          decode_scratchpad() MUST read all 8 bits of pulse[byte*8..byte*8+7]
     *          BEFORE writing scratchpad[byte]. Reordering loops will corrupt bytes 0-8.
     */
    union {
        volatile uint16_t edge[DS18B20_SCRATCHPAD_BITS / 2]; /**< Edge timestamps for presence detection */
        volatile uint8_t pulse[DS18B20_SCRATCHPAD_BITS]; /**< Pulse durations for data decoding */
        uint8_t scratchpad[DS18B20_SCRATCHPAD_LEN]; /**< Sensor scratchpad data */
        uint64_t fill_union; /**< Utility field for filling the union */
    };
    ds18b20_state_t current_state; /**< Current state of the state machine */
    uint8_t address_mode; /**< 0 = Skip ROM (all devices), non-zero = Match ROM */
    uint8_t scan_mode; /**< 1 = simultaneous multi-device conversion (scan) mode */
    uint8_t scan_index; /**< Index of the device currently read in scan mode */
    uint8_t selected_rom[DS18B20_ROM_BYTES]; /**< ROM of the selected device */
    uint8_t addr_cmd[DS18B20_MATCH_SLOTS + 1]; /**< Pulse buffer for Match ROM command (+ trailing 0 for hardware bus release) */
    uint8_t resolution; /**< Conversion resolution in bits (9..12); drives the conversion wait */
} DS18B20_ctx_t;

/**
 * @brief Non-blocking single-command transaction phases
 */
typedef enum {
    DS18B20_TXN_RESET, /**< reset scheduled; check presence */
    DS18B20_TXN_WRITE, /**< command (prefix + function + payload) write scheduled */
    DS18B20_TXN_READ, /**< data read scheduled (read_bytes != 0) */
    DS18B20_TXN_WAIT, /**< timed wait scheduled (wait_us != 0) */
    DS18B20_TXN_DONE /**< finished; hand the timer back to the measurement */
} ds18b20_txn_phase_t;

/**
 * @brief Non-blocking single-command transaction context
 * @note Drives every infrequent DS18B20 command (Read ROM, Write Scratchpad
 *       thresholds, Copy/Recall EEPROM, Read Power Supply, raw Read
 *       Scratchpad) with the same reset -> write -> (read | wait) discipline
 *       as the resolution state machine. The pulse buffer must stay valid
 *       across poll calls because the DMA feeds CCR1 from it asynchronously.
 */
typedef struct {
    ds18b20_txn_phase_t phase; /**< Current phase of the transaction */
    uint8_t command; /**< DS18B20 function command byte (0x33/0x4E/0x48/0xB8/0xB4/0xBE) */
    uint8_t* out; /**< User result buffer (valid until the command finishes) */
    uint8_t payload[3]; /**< Write Scratchpad payload (TH, TL, CFG) */
    uint8_t payload_len; /**< 0..3 (payload bytes written after the command) */
    uint8_t read_bytes; /**< Bytes to read back (0 = no read phase) */
    uint16_t wait_us; /**< Timed wait after the command (0 = none) */
    uint8_t bare; /**< 1 = no addressing prefix (Read ROM: single-device bus only) */
    uint8_t slots; /**< Bit slots in the built pulses (incl. prefix and payload) */
    uint8_t pulses[DS18B20_RES_SLOTS_MAX + 1]; /**< Built command (+ trailing 0 for hardware bus release) */
    uint8_t raw[DS18B20_SCRATCHPAD_LEN]; /**< Decoded read result */
    uint8_t ok; /**< 1 once the transaction completed with a device present / valid read */
    uint8_t finished; /**< 1 once the transaction finished (or aborted) */
} ds18b20_txn_ctx_t;

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Variables DS18B20 Private Variables
 * @{
 */

/** @brief Global driver context instance */
static DS18B20_ctx_t ctx;

/** @brief ROM table of the discovered devices (filled by the device search). */
static uint8_t dev_roms[DS18B20_MAX_DEVICES][DS18B20_ROM_BYTES];
/** @brief Number of devices currently stored in dev_roms. */
static uint8_t dev_count;

/* B1 guard: the 1-Wire layer reads cmd[slots] as the trailing zero-pulse that
 * the final DMA transfer feeds into CCR1 to release the 1-Wire bus. The
 * addr_cmd buffer must therefore hold DS18B20_MATCH_SLOTS + 1 entries, not
 * DS18B20_MATCH_SLOTS, or that last slot reads one byte past the buffer. */
_Static_assert(sizeof(ctx.addr_cmd) >= DS18B20_MATCH_SLOTS + 1,
               "addr_cmd must be DS18B20_MATCH_SLOTS + 1 to hold the trailing "
               "bus-release pulse consumed by the 1-Wire layer");

/** @brief Global single-command transaction context instance */
static ds18b20_txn_ctx_t txn_ctx;

