a5021/stm32-async-1wire/src/ds18b20.c
/* B1 guard: the trailing zero-pulse consumed by the CCR1-feed DMA's final
 * transfer must always be present at the exact slot index used for the write
 * (see txn_build_pulses); the buffer is sized for the longest (Match ROM)
 * command write. */
_Static_assert(sizeof(txn_ctx.pulses) >= DS18B20_RES_SLOTS_MAX + 1,
               "txn_ctx.pulses must be DS18B20_RES_SLOTS_MAX + 1 to hold the "
               "trailing bus-release pulse consumed by the 1-Wire layer");

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Functions DS18B20 Private Functions
 * @{
 */

/**
 * @brief Default weak implementation for busy indicator (e.g. LED toggling during measurement)
 * @param[in] action 0 = idle, non-zero = busy
 */
__WEAK void ds18b20_busy(unsigned action) {
    (void)action;
    // Default implementation - empty (no LED control)
}

/**
 * @brief Default weak implementation for measurement completion callback
 * @param[in] temp_tenths Temperature value in tenths of degrees Celsius, or error code
 */
__WEAK void ds18b20_complete(int16_t temp_tenths) {
    (void)temp_tenths;
    // Default implementation - empty (no temperature handling)
}

/**
 * @brief Calculate Dallas/Maxim CRC-8 over a byte buffer
 * @param[in] data Input buffer
 * @param[in] len Number of bytes to process
 * @return CRC-8 checksum value
 * @note Delegates to the shared 1-Wire layer (same Dallas/Maxim algorithm).
 */
uint8_t ds18b20_crc8(const uint8_t* data, uint8_t len) {
    return onewire_crc8(data, len);
}

/**
 * @brief Calculate CRC8 checksum for DS18B20 scratchpad data validation
 * @return CRC8 checksum value
 */
__STATIC_FORCEINLINE uint8_t check_scratchpad_crc(void) {
    return ds18b20_crc8(ctx.scratchpad, DS18B20_CRC8_BYTES);
}

/**
 * @brief Decode pulse durations into scratchpad bytes using bit timing analysis
 * @note Branchless implementation: accumulates bits into native-width variable,
 *       then writes once per byte. Relies on union aliasing invariant — see DS18B20_ctx_t.
 */
__STATIC_FORCEINLINE void decode_scratchpad(void) {
    for (unsigned byte = 0; byte < DS18B20_SCRATCHPAD_LEN; ++byte) {
        const unsigned base = byte * DS18B20_BITS_PER_BYTE;
        unsigned value = 0;
        for (unsigned bit = 0; bit < DS18B20_BITS_PER_BYTE; ++bit) {
            value |= (unsigned)(ctx.pulse[base + bit] <= SHORT_PULSE_MAX) << bit;
        }
        ctx.scratchpad[byte] = (uint8_t)value;
    }
}

/**
 * @brief Convert raw temperature data from scratchpad to tenths of degrees Celsius
 * @return Temperature value in tenths of degrees Celsius
 */
__STATIC_FORCEINLINE int16_t decode_temperature(void) {
    // Combine LSB and MSB of temperature register (bytes 0 and 1)
    int16_t raw = (int16_t)((ctx.scratchpad[1] << 8) | ctx.scratchpad[0]);
    // Convert to tenths of degrees Celsius (raw value in 1/16th degrees):
    // multiply by 10 and divide by 16 with round-half-away-from-zero so the
    // sign is preserved for small negative values (raw = -1 would otherwise
    // truncate to 0 and report +0.0 °C for a temperature below freezing).
    return (int16_t)(((int32_t)raw * 10 + ((raw < 0) ? -8 : 8)) / 16);
}

/**
 * @brief Map a conversion resolution to its exact DS18B20 conversion time
 * @param[in] res Resolution in bits (9..12)
 * @param[out] arr Auto-reload value (one timer period in µs)
 * @param[out] rcr Repetition counter (number of periods - 1)
 * @note DS18B20 datasheet conversion times: 9-bit 93.75ms, 10-bit 187.5ms,
 *       11-bit 375ms, 12-bit 750ms. The (ARR, RCR) pairs below reproduce
 *       exactly those minimum waits at 1µs/tick with the invariant
 *       (RCR + 1) × ARR = wait in µs.
 */
__STATIC_FORCEINLINE void resolution_to_wait(uint8_t res, uint16_t* arr, uint8_t* rcr) {
    switch (res) {
    case 9:
        *arr = 9375;
        *rcr = 9;
        break; /* 10 × 9.375ms = 93.75ms */
    case 10:
        *arr = 18750;
        *rcr = 9;
        break; /* 10 × 18.75ms = 187.5ms */
    case 11:
        *arr = 18750;
        *rcr = 19;
        break; /* 20 × 18.75ms = 375ms */
    case 12:
    default:
        *arr = 62500;
        *rcr = 11;
        break; /* 12 × 62.5ms = 750ms */
    }
}

/**
 * @brief Wait for temperature conversion to complete
 * @note Non-blocking - starts a timer that generates an update event when the
 *       conversion of the currently configured resolution (ctx.resolution)
 *       is guaranteed finished: 93.75ms (9 bit) .. 750ms (12 bit).
 */
__STATIC_FORCEINLINE void wait_conversion(void) {
    uint16_t arr;
    uint8_t rcr;
    resolution_to_wait(ctx.resolution, &arr, &rcr);
    onewire_start_timer(arr, rcr);
}

/**
 * @brief Start inter-measurement pause period (5s)
 * @note Non-blocking - starts timer for inter-measurement delay
 */
__STATIC_FORCEINLINE void start_cycle_pause(void) { onewire_start_timer(PAUSE_5S); }

/**
 * @brief Build the invariant Match ROM prefix (0x55 + selected ROM)
 * @note Fills the first DS18B20_PREFIX_SLOTS entries of ctx.addr_cmd.
 *       The prefix depends only on the selected device, so it is built
 *       once in ds18b20_select() and reused for every command.
 */
__STATIC_FORCEINLINE void build_addr_prefix(void) {
    uint8_t* p = ctx.addr_cmd;
    onewire_encode_byte(p, DS18B20_MATCH_ROM);
    p += DS18B20_BITS_PER_BYTE;
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        onewire_encode_byte(p, ctx.selected_rom[i]);
        p += DS18B20_BITS_PER_BYTE;
    }
    /* B1: guarantee the trailing zero-pulse that the 1-Wire layer reads as its
     * final DMA transfer into CCR1 is present, even though build_addr_cmd()
     * only ever writes slots 0 .. DS18B20_MATCH_SLOTS - 1. Without this, the
     * bus-release pulse would depend on whatever happened to sit at
     * addr_cmd[DS18B20_MATCH_SLOTS] (typically 0 from .bss, but not guaranteed). */
    ctx.addr_cmd[DS18B20_MATCH_SLOTS] = 0;
}

/**
 * @brief Append one command byte to the pre-built Match ROM prefix
 * @param[in] cmd_byte Command byte to send after the ROM address
 * @note Requires build_addr_prefix() to have been called for the current
 *       selected device. Only the last byte (8 slots) is re-encoded per call.
 */
__STATIC_FORCEINLINE void build_addr_cmd(uint8_t cmd_byte) {
    onewire_encode_byte(&ctx.addr_cmd[DS18B20_PREFIX_SLOTS], cmd_byte);
}

/**
 * @}
 */

/**
 * @defgroup DS18B20_Search_Internal DS18B20 Device Search (via the 1-Wire layer)
 * @brief Wraps the generic Search ROM (0xF0) / Alarm Search (0xEC) engine of
 *        the shared 1-Wire layer. The device search additionally stores every
 *        found ROM in the scan-mode device table; the alarm search leaves the
 *        table untouched so a previous scan keeps its addresses.
 * @{
 */

/** @brief User sink stored for the duration of a search */
static ds18b20_search_sink_t search_user_sink;

/**
 * @brief Device-search sink: store the ROM in the scan-mode device table
 *        (capped at DS18B20_MAX_DEVICES), then forward to the user sink.
 */
static uint8_t search_store_sink(const uint8_t* rom) {
    if (dev_count < DS18B20_MAX_DEVICES) {
        for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
            dev_roms[dev_count][i] = rom[i];
        }
        dev_count++;
    }
    return search_user_sink ? search_user_sink(rom) : 0;
}

/**
 * @brief Alarm-search sink: forward to the user sink without touching the
 *        scan-mode device table.
 */
static uint8_t search_alarm_sink(const uint8_t* rom) {
    return search_user_sink ? search_user_sink(rom) : 0;
}

/**
 * @brief Start a non-blocking device search
 * @param[in] sink Callback invoked per found DS18B20 device (may be NULL)
 * @param[in] max_devices Maximum number of devices to report (0 aborts)
 * @note The device search (re)populates the scan-mode device table.
 * @note Ownership guards: the search and the measurement state machine share
 *       TIM1/DMA, so a new search may only be started while the measurement
 *       state machine is IDLE; a running search rejects a new start.
 */
void ds18b20_search_start(ds18b20_search_sink_t sink, uint8_t max_devices) {
    if (ctx.current_state != DS18B20_ST_IDLE) {
        return; // a measurement cycle is in progress
    }
    if (onewire_search_active()) {
        return; // a search is already running - keep its sink and table
    }
    if (!txn_ctx.finished) {
        return; // a command transaction is running
    }
    dev_count = 0;
    search_user_sink = sink;
    onewire_search_start(search_store_sink, max_devices, DS18B20_SEARCH_ROM, DS18B20_FAMILY_CODE);
}

/**
 * @brief Start a non-blocking alarm search
 * @param[in] sink Callback invoked per DS18B20 currently in alarm (may be NULL)
 * @param[in] max_devices Maximum number of alarmed devices to report (0 aborts)
 * @note Only devices in alarm state respond to Alarm Search (0xEC). The
 *       scan-mode device table is left untouched.
 */
void ds18b20_alarm_search_start(ds18b20_search_sink_t sink, uint8_t max_devices) {
    if (ctx.current_state != DS18B20_ST_IDLE) {
        return; // a measurement cycle is in progress
    }
    if (onewire_search_active()) {
        return; // a search is already running - keep its sink
    }
    if (!txn_ctx.finished) {
        return; // a command transaction is running
    }
    search_user_sink = sink;
    onewire_search_start(search_alarm_sink, max_devices, DS18B20_ALARM_SEARCH, DS18B20_FAMILY_CODE);
}

/**
 * @brief Advance the non-blocking device search by one hardware operation
 * @return 1 when the search is finished, 0 while still running
 */
uint8_t ds18b20_search_poll(void) { return onewire_search_poll(); }

/**
 * @brief Number of DS18B20 devices found (valid once the search finished)
 * @return Count of found devices
 */
uint8_t ds18b20_search_count(void) { return onewire_search_count(); }

/**
 * @brief Advance the non-blocking alarm search by one hardware operation
 * @return 1 when the search is finished, 0 while still running
 */
uint8_t ds18b20_alarm_search_poll(void) { return onewire_search_poll(); }

/**
 * @brief Number of DS18B20 devices found in alarm (valid once finished)
 * @return Count of alarmed devices
 */
uint8_t ds18b20_alarm_search_count(void) { return onewire_search_count(); }

/**
 * @}
 */

/**
 * @defgroup DS18B20_Resolution_Internal DS18B20 Internal Non-Blocking Resolution Change
 * @brief Change the temperature conversion resolution (9..12 bit) with the same
 *        non-blocking discipline as the device search: every state performs
 *        exactly one hardware-timed operation via the internal bus primitives,
 *        so a poll call never blocks. The config write is sent with Write
 *        Scratchpad (0x4E) + TH + TL + CFG; it takes effect immediately and is
 *        not persisted to the EEPROM (no Copy Scratchpad, which would need a
 *        strong pull-up under parasitic power).
 * @{
 */

/** @brief Resolution state machine phases */
typedef enum {
    DS18B20_RES_RESET, /**< reset scheduled; check presence */
    DS18B20_RES_WRITE, /**< config write scheduled (skip/match + 0x4E + TH + TL + CFG) */
    DS18B20_RES_DONE /**< operation finished; hand the timer back to the measurement */
} res_phase_t;

/**
 * @brief Non-blocking resolution change context
 * @note The pulse buffer must stay valid across poll calls because the DMA
 *       feeds CCR1 from it asynchronously while the config write is sent.
 */
typedef struct {
    res_phase_t phase; /**< Current phase of the resolution state machine */
    uint8_t pending_res; /**< Resolution (bits) to apply */
    uint8_t applied; /**< 1 once the config write completed (resolution actually changed) */
    uint8_t finished; /**< 1 once the operation has completed (or aborted) */
    uint8_t pulses[DS18B20_RES_SLOTS_MAX + 1]; /**< Pulse buffer for the config write (+ trailing 0 for hardware bus release) */
} res_ctx_t;

/** @brief Global resolution context instance */
static res_ctx_t res_ctx;

