a5021/stm32-async-1wire/src/ds18b20.c
/* B1 guard: the trailing zero-pulse consumed by the CCR1-feed DMA's final
 * transfer must always be present at the exact slot index used for the write
 * (see build_res_pulses); the buffer is sized for the longest (Match ROM) mode. */
_Static_assert(sizeof(res_ctx.pulses) >= DS18B20_RES_SLOTS_MAX + 1,
               "res_ctx.pulses must be DS18B20_RES_SLOTS_MAX + 1 to hold the "
               "trailing bus-release pulse consumed by the 1-Wire layer");

/**
 * @brief Build the DS18B20 configuration register byte for a resolution
 * @param[in] res Resolution in bits (9..12)
 * @return Configuration register byte (R1/R0 bits set, rest at reset value)
 * @note 9 bit -> 0x1F, 10 bit -> 0x3F, 11 bit -> 0x5F, 12 bit -> 0x7F.
 */
__STATIC_FORCEINLINE uint8_t res_config_byte(uint8_t res) {
    return (uint8_t)(0x1Fu | ((res - DS18B20_RES_MIN) << 5));
}

/**
 * @brief Pre-build the resolution config write into res_ctx.pulses
 * @param[in] res Resolution in bits (9..12)
 * @note Encodes Skip ROM (0xCC) or Match ROM (0x55 + selected ROM) followed by
 *       Write Scratchpad (0x4E), TH, TL and the config byte. The trailing
 *       zero-pulse that the 1-Wire layer consumes as the final DMA transfer
 *       (hardware bus release) is written at the slot index of the mode
 *       actually used, not always at the end of the buffer.
 */
__STATIC_FORCEINLINE void build_res_pulses(uint8_t res) {
    // In scan mode the config write must reach every sensor, so the Match ROM
    // address is skipped even if a single-device address is still selected.
    const uint8_t use_match = ctx.address_mode && !ctx.scan_mode;
    uint8_t* p = res_ctx.pulses;
    if (use_match) {
        onewire_encode_byte(p, DS18B20_MATCH_ROM);
        p += DS18B20_BITS_PER_BYTE;
        for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
            onewire_encode_byte(p, ctx.selected_rom[i]);
            p += DS18B20_BITS_PER_BYTE;
        }
    } else {
        onewire_encode_byte(p, 0xCC); /* Skip ROM */
        p += DS18B20_BITS_PER_BYTE;
    }
    onewire_encode_byte(p, DS18B20_WRITE_SCRATCHPAD);
    p += DS18B20_BITS_PER_BYTE;
    onewire_encode_byte(p, DS18B20_RES_TH);
    p += DS18B20_BITS_PER_BYTE;
    onewire_encode_byte(p, DS18B20_RES_TL);
    p += DS18B20_BITS_PER_BYTE;
    onewire_encode_byte(p, res_config_byte(res));
    res_ctx.pulses[use_match ? DS18B20_RES_SLOTS_MAX : DS18B20_RES_SLOTS_MIN] = 0;
}

/**
 * @brief Start a non-blocking resolution change
 * @param[in] bits New resolution in bits: DS18B20_RES_MIN (9) .. DS18B20_RES_MAX (12)
 * @note Out-of-range values are ignored. The change is scheduled only between
 *       measurement cycles and only while the device search is idle; otherwise
 *       it is ignored. While running, it owns TIM1/DMA; poll it with
 *       ds18b20_set_resolution_poll() until it reports completion, then call
 *       ds18b20_poll() again to resume measuring with the new resolution.
 */
void ds18b20_set_resolution(uint8_t bits) {
    if (bits < DS18B20_RES_MIN || bits > DS18B20_RES_MAX) {
        return; // out of range - ignore
    }
    if (!res_ctx.finished) {
        return; // a resolution change is already running
    }
    if (!txn_ctx.finished) {
        return; // a command transaction is running
    }
    if (onewire_search_active()) {
        return; // the device search owns the timer
    }
    if (ctx.current_state != DS18B20_ST_IDLE) {
        return; // a measurement cycle is in progress
    }
    res_ctx.pending_res = bits;
    res_ctx.applied = 0;
    res_ctx.finished = 0;
    build_res_pulses(bits); // Pre-build the config write for the current address mode
    res_ctx.phase = DS18B20_RES_RESET;
    onewire_reset(ctx.edge); // Schedule the first hardware operation
}

/**
 * @brief Advance the non-blocking resolution change by one hardware operation
 * @return 1 when the change is finished (successfully or aborted), 0 while running
 * @note When this returns 1 the next measurement uses the requested resolution
 *       if (and only if) the config write actually completed; an aborted change
 *       (e.g. no device present) leaves the resolution unchanged.
 */
uint8_t ds18b20_set_resolution_poll(void) {
    if (res_ctx.finished) {
        return 1;
    }

    if (res_ctx.phase == DS18B20_RES_DONE) {
        // The last hardware operation completed (config written or aborted):
        // hand the timer back to the measurement state machine exactly once.
        T1.EGR = TIM_EGR(UG);
        __DSB();
        if (res_ctx.applied) {
            ctx.resolution = res_ctx.pending_res;
        }
        res_ctx.finished = 1;
        return 1;
    }

    // Wait for the currently scheduled hardware operation to complete.
    // This is a non-blocking poll, not a busy-wait.
    if (!onewire_bus_done()) {
        return 0;
    }

    switch (res_ctx.phase) {
    case DS18B20_RES_RESET:
        // Reset completed: a presence pulse means at least one device is on
        // the bus, so send the config write for the requested resolution.
        if (!onewire_present(ctx.edge)) {
            res_ctx.phase = DS18B20_RES_DONE;
            break;
        }
        onewire_write_slots(res_ctx.pulses,
                            ctx.address_mode ? DS18B20_RES_SLOTS_MAX
                                             : DS18B20_RES_SLOTS_MIN);
        res_ctx.phase = DS18B20_RES_WRITE;
        break;

    case DS18B20_RES_WRITE:
        // Config write completed: the sensor now uses the new resolution.
        res_ctx.applied = 1;
        res_ctx.phase = DS18B20_RES_DONE;
        break;

    case DS18B20_RES_DONE:
    default:
        break;
    }

    return 0;
}

/**
 * @brief Current conversion resolution in bits
 * @return Resolution in bits (9..12); the default is 12
 * @note Auto-derived from the last valid scratchpad read (byte 4, R1/R0),
 *       so it also tracks a resolution changed externally.
 */
uint8_t ds18b20_get_resolution(void) { return ctx.resolution; }

/**
 * @brief Finish the current scan-mode device read
 * @note Called after every per-device report in scan mode. Advances to the
 *       next device (CONTINUE, skipping a fresh conversion) or, after the last
 *       device, returns to IDLE and starts the inter-measurement pause so the
 *       next round begins with a new broadcast Convert T. In single-device
 *       mode it only starts the inter-measurement pause.
 */
static void scan_finish_or_next(void) {
    if (!ctx.scan_mode) {
        start_cycle_pause();
        return;
    }
    ctx.scan_index++;
    if (ctx.scan_index < dev_count) {
        ctx.current_state = DS18B20_ST_CONTINUE;
        /* DECODE armed nothing, so without a running timer no UIF would ever
         * drive the CONTINUE state again (single-device mode gets its UIF from
         * the inter-measurement pause). Arm a short scheduling delay: its UIF
         * is the bridge to CONTINUE, which then arms the real bus reset. */
        onewire_start_timer(SCAN_DEVICE_GAP);
    } else {
        ctx.current_state = DS18B20_ST_IDLE;
        start_cycle_pause();
    }
}

/**
 * @brief Begin simultaneous conversion of every discovered device
 * @see ds18b20_scan_start() in ds18b20.h
 */
void ds18b20_scan_start(void) {
    if (ctx.current_state != DS18B20_ST_IDLE) {
        return; // a measurement cycle is in progress
    }
    if (onewire_search_active() || !res_ctx.finished || !txn_ctx.finished) {
        return; // the search, a resolution change or a command owns the timer
    }
    if (dev_count == 0) {
        return; // nothing discovered: there is no device to convert
    }
    ctx.scan_mode = 1;
    ctx.scan_index = 0;
}

/**
 * @brief Number of DS18B20 devices stored by the driver
 * @see ds18b20_device_count() in ds18b20.h
 */
uint8_t ds18b20_device_count(void) { return dev_count; }

/**
 * @brief ROM address of a discovered device
 * @see ds18b20_device_rom() in ds18b20.h
 */
const uint8_t* ds18b20_device_rom(uint8_t index) {
    if (index >= dev_count) {
        return 0;
    }
    return dev_roms[index];
}

/**
 * @brief Index of the device whose result ds18b20_complete() just reported
 * @see ds18b20_scan_index() in ds18b20.h
 */
uint8_t ds18b20_scan_index(void) { return ctx.scan_index; }

/**
 * @}
 */

/**
 * @defgroup DS18B20_Command_Impl DS18B20 Non-Blocking Command Transactions
 * @brief Shared non-blocking engine for the infrequent DS18B20 commands that
 *        the measurement state machine does not issue: Read ROM (0x33),
 *        Write Scratchpad thresholds (0x4E), Copy Scratchpad (0x48), Recall
 *        EEPROM (0xB8), Read Power Supply (0xB4) and raw Read Scratchpad
 *        (0xBE). Every command runs reset -> presence -> write -> (read |
 *        timed wait) -> done, one hardware-timed operation per poll call, so
 *        the same non-blocking discipline as the measurement, search and
 *        resolution state machines is preserved. Each command owns TIM1/DMA
 *        while it runs and hands the timer back to ds18b20_poll() when done.
 * @{
 */

/**
 * @brief Ownership guard shared by every command transaction start
 * @return 1 when a new transaction may be scheduled
 */
__STATIC_FORCEINLINE uint8_t txn_can_start(void) {
    return (uint8_t)(ctx.current_state == DS18B20_ST_IDLE &&
                     !onewire_search_active() && res_ctx.finished &&
                     txn_ctx.finished);
}

/**
 * @brief Build the command pulse sequence into txn_ctx.pulses
 * @note Encodes the addressing prefix (Skip ROM 0xCC, or Match ROM 0x55 +
 *       selected ROM; none for a bare command such as Read ROM), the function
 *       command byte and the optional payload (Write Scratchpad TH/TL/CFG).
 *       The trailing zero-pulse that the 1-Wire layer consumes as the final
 *       DMA transfer (hardware bus release) is written at the slot index of
 *       the mode actually used, not always at the end of the buffer.
 */
__STATIC_FORCEINLINE void txn_build_pulses(void) {
    // In scan mode the command must reach every sensor, so the Match ROM
    // address is skipped even if a single-device address is still selected.
    const uint8_t use_match = ctx.address_mode && !ctx.scan_mode && !txn_ctx.bare;
    uint8_t* p = txn_ctx.pulses;
    uint8_t bytes = 0;
    if (!txn_ctx.bare) {
        if (use_match) {
            onewire_encode_byte(p, DS18B20_MATCH_ROM);
            p += DS18B20_BITS_PER_BYTE;
            bytes++;
            for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
                onewire_encode_byte(p, ctx.selected_rom[i]);
                p += DS18B20_BITS_PER_BYTE;
                bytes++;
            }
        } else {
            onewire_encode_byte(p, 0xCC); /* Skip ROM */
            p += DS18B20_BITS_PER_BYTE;
            bytes++;
        }
    }
    onewire_encode_byte(p, txn_ctx.command);
    p += DS18B20_BITS_PER_BYTE;
    bytes++;
    for (uint8_t i = 0; i < txn_ctx.payload_len; i++) {
        onewire_encode_byte(p, txn_ctx.payload[i]);
        p += DS18B20_BITS_PER_BYTE;
        bytes++;
    }
    txn_ctx.slots = (uint8_t)(bytes * DS18B20_BITS_PER_BYTE);
    /* B1: guarantee the trailing zero-pulse that the 1-Wire layer reads as its
     * final DMA transfer into CCR1, even though the command write only ever
     * fills slots 0 .. slots - 1 (see build_res_pulses for the same pattern). */
    txn_ctx.pulses[txn_ctx.slots] = 0;
}

/**
 * @brief Decode the captured read pulses into txn_ctx.raw
 * @note Reads ctx.pulse (written by the read DMA), never aliased with raw:
 *       the union invariant of decode_scratchpad() does not apply here.
 */
__STATIC_FORCEINLINE void txn_decode_read(void) {
    for (uint8_t byte = 0; byte < txn_ctx.read_bytes; byte++) {
        const uint8_t base = (uint8_t)(byte * DS18B20_BITS_PER_BYTE);
        uint8_t value = 0;
        for (uint8_t bit = 0; bit < DS18B20_BITS_PER_BYTE; bit++) {
            value |= (ctx.pulse[base + bit] <= SHORT_PULSE_MAX)
                         ? (uint8_t)(1u << bit)
                         : 0u;
        }
        txn_ctx.raw[byte] = value;
    }
}

/**
 * @brief Copy the decoded read result into the user buffer
 * @param[in] len Number of bytes to copy (txn_ctx.out must hold at least len)
 */
__STATIC_FORCEINLINE void txn_copy_out(uint8_t len) {
    for (uint8_t i = 0; i < len; i++) {
        txn_ctx.out[i] = txn_ctx.raw[i];
    }
}

/**
 * @brief Advance the active command transaction by one hardware operation
 * @return 1 when the transaction finished (successfully or aborted), 0 while
 *         running
 */
static uint8_t txn_poll(void) {
    if (txn_ctx.finished) {
        return 1;
    }

    if (txn_ctx.phase == DS18B20_TXN_DONE) {
        // The last hardware operation completed (command done or aborted):
        // hand the timer back to the measurement state machine exactly once.
        T1.EGR = TIM_EGR(UG);
        __DSB();
        txn_ctx.finished = 1;
        return 1;
    }

