a5021/stm32-async-1wire/src/ds18b20.c
    // Wait for the currently scheduled hardware operation to complete.
    // This is a non-blocking poll, not a busy-wait.
    if (!onewire_bus_done()) {
        return 0;
    }

    switch (txn_ctx.phase) {
    case DS18B20_TXN_RESET:
        // Reset completed: a presence pulse means at least one device is on
        // the bus, so send the command for this transaction.
        if (!onewire_present(ctx.edge)) {
            txn_ctx.phase = DS18B20_TXN_DONE;
            break;
        }
        onewire_write_slots(txn_ctx.pulses, txn_ctx.slots);
        txn_ctx.phase = DS18B20_TXN_WRITE;
        break;

    case DS18B20_TXN_WRITE:
        // Command write completed: read the response back if the command has
        // one, otherwise wait the required hold-off or finish immediately.
        if (txn_ctx.read_bytes) {
            onewire_read_data(ctx.pulse, txn_ctx.read_bytes);
            txn_ctx.phase = DS18B20_TXN_READ;
        } else if (txn_ctx.wait_us) {
            onewire_start_timer(txn_ctx.wait_us, 0);
            txn_ctx.phase = DS18B20_TXN_WAIT;
        } else {
            txn_ctx.ok = 1;
            txn_ctx.phase = DS18B20_TXN_DONE;
        }
        break;

    case DS18B20_TXN_READ:
        // Data read completed: decode the captured pulse durations.
        txn_decode_read();
        txn_ctx.ok = 1;
        txn_ctx.phase = DS18B20_TXN_DONE;
        break;

    case DS18B20_TXN_WAIT:
        // Hold-off completed (Copy Scratchpad / Recall EEPROM).
        txn_ctx.ok = 1;
        txn_ctx.phase = DS18B20_TXN_DONE;
        break;

    case DS18B20_TXN_DONE:
    default:
        break;
    }

    return 0;
}

/**
 * @brief Schedule a new non-blocking command transaction
 * @param[in] command DS18B20 function command byte
 * @param[in] out User result buffer (may be NULL; only written on success)
 * @param[in] payload Up to 3 payload bytes (Write Scratchpad TH/TL/CFG)
 * @param[in] payload_len Number of payload bytes (0..3)
 * @param[in] read_bytes Bytes to read back after the command (0 = none)
 * @param[in] wait_us Timed hold-off after the command (0 = none)
 * @param[in] bare 1 to send the command without an addressing prefix
 * @note Ignored unless the driver is IDLE, the device search and any
 *       resolution change are finished, and no transaction is already
 *       running. The result buffer must stay valid until the transaction
 *       completes (ds18b20_*_poll() reports 1).
 */
static void txn_start(uint8_t command, uint8_t* out, const uint8_t* payload,
                      uint8_t payload_len, uint8_t read_bytes, uint16_t wait_us,
                      uint8_t bare) {
    if (!txn_can_start()) {
        return; // the timer belongs to someone else right now
    }
    txn_ctx.command = command;
    txn_ctx.out = out;
    txn_ctx.read_bytes = read_bytes;
    txn_ctx.wait_us = wait_us;
    txn_ctx.bare = bare;
    txn_ctx.payload_len = payload_len;
    for (uint8_t i = 0; i < payload_len && i < sizeof(txn_ctx.payload); i++) {
        txn_ctx.payload[i] = payload[i];
    }
    txn_ctx.ok = 0;
    txn_ctx.finished = 0;
    txn_build_pulses(); // Pre-build the command for the current address mode
    txn_ctx.phase = DS18B20_TXN_RESET;
    onewire_reset(ctx.edge); // Schedule the first hardware operation
}

/**
 * @brief Read the 64-bit ROM of the (only) DS18B20 on the bus
 * @param[in,out] rom Buffer for the 8-byte ROM (LSB first); written on success
 * @note Valid only when exactly one device is on the bus (datasheet Read ROM
 *       0x33). With several devices use the device search (ds18b20_search_*).
 * @note Result validity: check ds18b20_last_command_ok() or the CRC over the
 *       7 leading bytes (ds18b20_crc8(rom, 7) == rom[7]).
 */
void ds18b20_read_rom(uint8_t* rom) {
    txn_start(DS18B20_READ_ROM, rom, 0, 0, DS18B20_ROM_BYTES, 0, 1);
}

/**
 * @brief Advance the non-blocking Read ROM transaction
 * @return 1 when finished (successfully or aborted), 0 while running
 */
uint8_t ds18b20_read_rom_poll(void) {
    if (!txn_poll()) {
        return 0;
    }
    if (txn_ctx.ok && txn_ctx.out) {
        txn_copy_out(DS18B20_ROM_BYTES);
    }
    return 1;
}

/**
 * @brief Configure the alarm trigger thresholds TH and TL
 * @param[in] th High-alarm trigger value (DS18B20 8-bit threshold code)
 * @param[in] tl Low-alarm trigger value (DS18B20 8-bit threshold code)
 * @note Uses the DS18B20 8-bit sign-extended temperature code, the same
 *       encoding the scratchpad TH/TL bytes use; converting to/from Celsius is
 *       left to the application. The current conversion resolution (byte 4,
 *       R1/R0) is written unchanged, so the resolution is not disturbed.
 * @note Takes effect immediately in the scratchpad; run ds18b20_copy_scratchpad()
 *       afterwards to persist TH/TL/CFG to the EEPROM.
 */
void ds18b20_set_alarm_thresholds(uint8_t th, uint8_t tl) {
    const uint8_t payload[3] = {th, tl, res_config_byte(ctx.resolution)};
    txn_start(DS18B20_WRITE_SCRATCHPAD, 0, payload, 3, 0, 0, 0);
}

/**
 * @brief Advance the non-blocking alarm threshold write
 * @return 1 when finished (successfully or aborted), 0 while running
 */
uint8_t ds18b20_set_alarm_thresholds_poll(void) { return txn_poll(); }

/**
 * @brief Read the 9-byte scratchpad (raw; includes TH, TL and the CRC)
 * @param[in,out] buf Buffer for the 9 scratchpad bytes (byte 0 = temp LSB,
 *                    bytes 2/3 = TH/TL, byte 8 = CRC); written on success
 * @note Result validity: check ds18b20_last_command_ok() or the CRC over the
 *       8 leading bytes (buf[8] == ds18b20_crc8(buf, 8)).
 */
void ds18b20_read_scratchpad(uint8_t* buf) {
    txn_start(DS18B20_READ_SCRATCHPAD, buf, 0, 0, DS18B20_SCRATCHPAD_LEN, 0, 0);
}

/**
 * @brief Advance the non-blocking raw scratchpad read
 * @return 1 when finished (successfully or aborted), 0 while running
 * @note On a valid read (CRC byte matches) the conversion resolution is
 *       auto-derived from the config byte (byte 4), like the measurement path.
 */
uint8_t ds18b20_read_scratchpad_poll(void) {
    if (!txn_poll()) {
        return 0;
    }
    if (txn_ctx.ok && txn_ctx.out) {
        txn_copy_out(DS18B20_SCRATCHPAD_LEN);
        if (txn_ctx.raw[DS18B20_SCRATCHPAD_LEN - 1] ==
            ds18b20_crc8(txn_ctx.raw, DS18B20_CRC8_BYTES)) {
            ctx.resolution = DS18B20_RES_MIN + ((txn_ctx.raw[4] >> 5) & 0x3);
        }
    }
    return 1;
}

/**
 * @brief Copy the scratchpad into the EEPROM (non-volatile)
 * @note External-power wiring only (as assumed by the whole driver): the copy
 *       is powered by the sensor's VDD, no strong pull-up is needed. The
 *       driver waits the datasheet t_COPY hold-off (10ms) before finishing.
 */
void ds18b20_copy_scratchpad(void) {
    txn_start(DS18B20_COPY_SCRATCHPAD, 0, 0, 0, 0, DS18B20_EEPROM_WAIT_US, 0);
}

/**
 * @brief Advance the non-blocking Copy Scratchpad transaction
 * @return 1 when finished (successfully or aborted), 0 while running
 */
uint8_t ds18b20_copy_scratchpad_poll(void) { return txn_poll(); }

/**
 * @brief Recall the EEPROM contents into the scratchpad
 * @note Loads the last EEPROM copy (TH/TL/CFG) into the volatile scratchpad.
 *       The driver waits the datasheet t_RECALL hold-off (10ms) before
 *       finishing.
 */
void ds18b20_recall_eeprom(void) {
    txn_start(DS18B20_RECALL_EEPROM, 0, 0, 0, 0, DS18B20_EEPROM_WAIT_US, 0);
}

/**
 * @brief Advance the non-blocking Recall EEPROM transaction
 * @return 1 when finished (successfully or aborted), 0 while running
 */
uint8_t ds18b20_recall_eeprom_poll(void) { return txn_poll(); }

/**
 * @brief Read the power-supply state of the DS18B20
 * @param[in,out] is_parasite Receives 1 when the device is parasite-powered,
 *                            0 when externally powered; written on success
 */
void ds18b20_read_power_supply(uint8_t* is_parasite) {
    txn_start(DS18B20_READ_POWER_SUPPLY, is_parasite, 0, 0, 1, 0, 0);
}

/**
 * @brief Advance the non-blocking power-supply read
 * @return 1 when finished (successfully or aborted), 0 while running
 */
uint8_t ds18b20_read_power_supply_poll(void) {
    if (!txn_poll()) {
        return 0;
    }
    if (txn_ctx.ok && txn_ctx.out) {
        // The sensor drives one bit: 0 = parasite power, 1 = external power.
        *txn_ctx.out = (txn_ctx.raw[0] & 0x01) ? 0u : 1u;
    }
    return 1;
}

/**
 * @brief Result of the last completed command transaction
 * @return 1 when the last ds18b20_*_poll() finished a transaction that found
 *         a device present (and, for read commands, read its data back),
 *         0 when it aborted (e.g. no device present) or nothing ran yet
 */
uint8_t ds18b20_last_command_ok(void) { return txn_ctx.ok; }

/**
 * @}
 */

/**
 * @defgroup DS18B20_Public_Functions DS18B20 Public Functions
 * @{
 */

/**
 * @brief Initialize DS18B20 driver - configure clocks and peripherals
 * @note Initializes the shared 1-Wire layer (timer/DMA/GPIO) and marks the
 *       driver idle so the measurement state machine owns the timer until the
 *       application starts a device search.
 */
void ds18b20_init(void) {
    onewire_init();
    // No resolution change or command transaction running after init; the
    // DS18B20 powers up at 12 bit (750ms conversion), so wait for exactly that
    // until a scratchpad read or set_resolution tells us otherwise.
    res_ctx.finished = 1;
    txn_ctx.finished = 1;
    ctx.resolution = DS18B20_RES_DEFAULT;
    ctx.scan_mode = 0;
    ctx.scan_index = 0;
}

/**
 * @brief Select which DS18B20 device to measure by its ROM address
 * @param[in] rom Pointer to the 8-byte ROM address (LSB first), or NULL to
 *                return to Skip ROM (broadcast) addressing
 * @note With a non-NULL address, the state machine sends Match ROM (0x55)
 *       plus the device address before each command, so only that device
 *       responds. Pass NULL (or a freshly initialised driver) to keep the
 *       legacy single-sensor Skip ROM behaviour. The address should come from
 *       the non-blocking device search (ds18b20_search_*).
 * @note The selection is applied only between measurement cycles (driver
 *       IDLE). Calls made while a cycle is running are ignored: applying them
 *       mid-cycle would overwrite ctx.addr_cmd while the DMA is still feeding
 *       it, corrupting the in-flight bus transaction. Re-call once the cycle
 *       finished (e.g., from ds18b20_complete(), which the driver invokes
 *       already in the IDLE state).
 */
void ds18b20_select(const uint8_t* rom) {
    if (ctx.current_state != DS18B20_ST_IDLE) {
        // Mid-cycle call - reject to keep the in-flight transaction intact.
        return;
    }
    if (!txn_ctx.finished) {
        // A command transaction is running - reject to keep its addressing.
        return;
    }
    // Explicit single-device addressing: leave simultaneous-conversion mode.
    ctx.scan_mode = 0;
    if (rom == 0) {
        ctx.address_mode = 0;
        return;
    }
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        ctx.selected_rom[i] = rom[i];
    }
    build_addr_prefix(); // Build the invariant Match ROM prefix once per selection
    ctx.address_mode = 1;
}

/**
 * @brief Check presence and issue command (shared by CONVERT and REQUEST states)
 * @param[in] cmd_byte Command byte to send
 * @param[in] skip_tbl Skip-ROM command table (for broadcast mode)
 * @param[in] next_state State to transition to on success
 */
static void issue_command(uint8_t cmd_byte, const uint8_t* skip_tbl, ds18b20_state_t next_state) {
    if (!onewire_present(ctx.edge)) {
        // Return to IDLE before the callback so a re-selection from inside
        // ds18b20_complete() is accepted (ds18b20_select() only acts at IDLE).
        ctx.current_state = DS18B20_ST_IDLE;
        // Turn the busy indicator off: busy(1) was set in START and this early
        // exit skips the DECODE state where busy(0) is normally cleared.
        ds18b20_busy(0);
        ds18b20_complete(DS18B20_TEMP_ERROR_NO_SENSOR);
        start_cycle_pause();
        return;
    }
    if (ctx.address_mode) {
        build_addr_cmd(cmd_byte);
        onewire_write_slots(ctx.addr_cmd, DS18B20_MATCH_SLOTS);
    } else {
        onewire_write_slots(skip_tbl, DS18B20_DMA_TRANSFERS);
    }
    ctx.current_state = next_state;
}

/**
 * @brief Main state machine function - must be called periodically from main loop
 * @note Non-blocking state machine that advances 1-Wire communication state
 * @note Uses timer update interrupt flag to determine when operations complete
 */
void ds18b20_poll(void) {
    // Ownership guard: while the device search, a resolution change or a
    // command transaction owns the timer, the measurement state machine must
    // stay out of the way and not react to their UIFs.
    if (onewire_search_active() || !res_ctx.finished || !txn_ctx.finished) {
        return;
    }

    // Check if timer update interrupt occurred (indicates operation completion)
    // This is the non-blocking way to detect when timed operations finish
    if (!(T1.SR & TIM_SR(UIF))) return;
    // Clear timer update interrupt flag
    T1.SR = 0;

    // State machine to manage 1-Wire communication sequence
    switch (ctx.current_state) {
    case DS18B20_ST_IDLE:
        // Initialize union memory (fills with 0xFF pattern)
        ctx.fill_union = (uint64_t)-1;
        // Transition to START state
        ctx.current_state = DS18B20_ST_START;
        /* fallthrough to START state immediately */
        __attribute__((fallthrough));

