a5021/stm32-async-1wire/src/ds18b20.c
    case DS18B20_ST_START:
        // Turn on LED to indicate measurement in progress
        ds18b20_busy(1);
        // Initiate 1-Wire bus reset sequence
        onewire_reset(ctx.edge);
        // Transition to CONVERT state
        ctx.current_state = DS18B20_ST_CONVERT;
        break;

    case DS18B20_ST_CONVERT:
        if (ctx.scan_mode) {
            // Scan mode: broadcast Convert T (Skip ROM) so every sensor starts
            // converting in parallel; a single conversion wait covers them all.
            ctx.scan_index = 0; // new round: read back starting from device 0
            ctx.address_mode = 0;
        }
        issue_command(DS18B20_CONVERT_T, conv_cmd, DS18B20_ST_WAIT);
        break;

    case DS18B20_ST_WAIT:
        // Start timer for conversion wait period (750ms typical)
        wait_conversion();
        ctx.current_state = DS18B20_ST_CONTINUE;
        break;

    case DS18B20_ST_CONTINUE:
        // Initiate second 1-Wire bus reset sequence
        onewire_reset(ctx.edge);
        ctx.current_state = DS18B20_ST_REQUEST;
        break;

    case DS18B20_ST_REQUEST:
        if (ctx.scan_mode) {
            // Scan mode: read the current device back via Match ROM.
            for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
                ctx.selected_rom[i] = dev_roms[ctx.scan_index][i];
            }
            build_addr_prefix();
            ctx.address_mode = 1;
        }
        issue_command(DS18B20_READ_SCRATCHPAD, read_cmd, DS18B20_ST_READ);
        break;

    case DS18B20_ST_READ:
        // Initiate scratchpad data read using timer capture and DMA
        onewire_read_data(ctx.pulse, DS18B20_SCRATCHPAD_LEN);
        // Transition to DECODE state
        ctx.current_state = DS18B20_ST_DECODE;
        break;

    case DS18B20_ST_DECODE: // Process received data and report temperature
        // Decode captured pulse durations into scratchpad bytes
        decode_scratchpad();
        // Turn off LED to indicate measurement complete
        ds18b20_busy(0);

        // Return to IDLE before the callback so a re-selection from inside
        // ds18b20_complete() is accepted (ds18b20_select() only acts at IDLE).
        // Scan mode keeps its own per-device addressing, so it stays in DECODE
        // and reports every device before returning to IDLE at the round end.
        if (!ctx.scan_mode) {
            ctx.current_state = DS18B20_ST_IDLE;
        }

        // Match ROM mode: if the addressed device is absent, nobody drives
        // the bus after the address, so the whole scratchpad reads back as
        // 0xFF. Report it as a missing sensor instead of a bogus CRC error.
        if (ctx.address_mode) {
            uint8_t all_ones = 1;
            for (uint8_t i = 0; i < DS18B20_SCRATCHPAD_LEN; i++) {
                if (ctx.scratchpad[i] != 0xFF) {
                    all_ones = 0;
                    break;
                }
            }
            if (all_ones) {
                ds18b20_complete(DS18B20_TEMP_ERROR_NO_SENSOR);
                scan_finish_or_next();
                break;
            }
        }

        // Validate reserved bytes per DS18B20 specification:
        // Byte 5 must be 0xFF, Byte 7 must be 0x10.
        // This catches all-zero, all-0xFF, and bus fault conditions.
        if (ctx.scratchpad[5] != 0xFF || ctx.scratchpad[7] != 0x10) {
            ds18b20_complete(DS18B20_TEMP_ERROR_CRC_FAIL);
            scan_finish_or_next();
            break;
        }

        // Validate CRC and report temperature or error
        if (ctx.scratchpad[DS18B20_SCRATCHPAD_LEN - 1] == check_scratchpad_crc()) {
            // CRC valid - decode and report temperature. The scratchpad is
            // trustworthy, so also trust the config byte (byte 4, R1/R0 bits
            // 6:5) and adapt the conversion wait for the next cycle: this keeps
            // the wait in sync with a resolution changed via
            // ds18b20_set_resolution() or externally. (R1/R0 are 0..3, so the
            // derived value is always within DS18B20_RES_MIN..DS18B20_RES_MAX.)
            // It is derived only on a valid CRC so a corrupted config byte can
            // never shorten the next conversion wait prematurely.
            ctx.resolution = DS18B20_RES_MIN + ((ctx.scratchpad[4] >> 5) & 0x3);
            ds18b20_complete(decode_temperature());
        } else {
            // CRC invalid - report error (resolution kept unchanged)
            ds18b20_complete(DS18B20_TEMP_ERROR_CRC_FAIL);
        }

        // Next scan-mode device (CONTINUE, no fresh conversion) or, after the
        // last device, back to IDLE plus the inter-measurement pause. In
        // single-device mode this only starts the pause.
        scan_finish_or_next();
        break;

    default:
        // Unexpected state - report generic error
        ctx.current_state = DS18B20_ST_IDLE;
        ds18b20_complete(DS18B20_TEMP_ERROR_GENERIC);
        break;
    }
}

/**
 * @}
 */